soapCountry.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
	<ns2:body xmlns:ns2="http://www.example.com/countries">
		<ns2:country>
			<ns2:name>Spain</ns2:name>
			<ns2:population>46704314</ns2:population>
			<ns2:capital>Madrid</ns2:capital>
			<ns2:currency>EUR</ns2:currency>
		</ns2:country>
		<ns2:country>
			<ns2:name>Poland</ns2:name>
			<ns2:population>38186860</ns2:population>
			<ns2:capital>Warsaw</ns2:capital>
			<ns2:currency>PLN</ns2:currency>
		</ns2:country>
	</ns2:body>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>